**DataFrame :**

**Features:**
    
1. "DataFrame" is a Data structure used in python.

2. It is just like a table, containing multiple rows and columns

3. Every row of a DataFrame holds and index automatically and the index starts from 0.

4. Many Data Type like List, Dictionary, Series (Data Structure) and Numpy Array can be converted into a DataFrame using Pandas.

5. DataFrames are indexable both by column and row. Also one can subset a DataFrame based on conditions.

**Lets start working with DataFrame:-**

**Creation Of DataFrame:**

In [1]:
import pandas as pd #importing library
data = [10,11,12] #list
df = pd.DataFrame(data) #creating dataframe

In [2]:
df #no columns are assigned

    0
0  10
1  11
2  12

**By default every element has an index 0,1,2 and so on....**

In [3]:
data = [['shahbaz',10], ['krishna', 11], ['ibrahim',12]] #n-dimensional array
df = pd.DataFrame(data,columns=['Name','Marks']) #converting to dataframe

In [4]:
df #with column name

      Name  Marks
0  shahbaz     10
1  krishna     11
2  ibrahim     12

In [5]:
import numpy as np
ar = np.array([[1,2,3],[4,5,6],[6,7,8]]) #numpy multidimensional array
df=pd.DataFrame(ar) #converting an array to a dataframe

In [6]:
df

   0  1  2
0  1  2  3
1  4  5  6
2  6  7  8

In [7]:
dictionary_1 = {'shahbaz':[1,2,3], 'krishna':[2,3,4], 'ibrahim':[3,4,5] } #creating dictionary
df = pd.DataFrame(dictionary_1) #converting the dictionary to dataframe

In [8]:
df

   shahbaz  krishna  ibrahim
0        1        2        3
1        2        3        4
2        3        4        5

**Setting index Manually**

In [9]:
df = pd.DataFrame(dictionary_1, index=['1st','2nd','3rd']) #with manual index

In [10]:
df

     shahbaz  krishna  ibrahim
1st        1        2        3
2nd        2        3        4
3rd        3        4        5

**Setting index and column names simultaneously:**

In [11]:
df = pd.DataFrame(ar, index=['English','Maths','Science'], columns=['shahbaz','krishna','ibrahim']) #setting index column manually

In [12]:
df

         shahbaz  krishna  ibrahim
English        1        2        3
Maths          4        5        6
Science        6        7        8

In [13]:
df2 = df[['shahbaz','krishna']].copy() #creating new dataframe from an old one

In [14]:
df2

         shahbaz  krishna
English        1        2
Maths          4        5
Science        6        7

**Indexing Columns and Rows from DataFrame**

In [15]:
df['krishna'] #indexing by column/taking only a column from the dataframe

English    2
Maths      5
Science    7
Name: krishna, dtype: int32

In [16]:
df[['shahbaz','ibrahim']] #taking multiple columns from the dataframe

         shahbaz  ibrahim
English        1        3
Maths          4        6
Science        6        8

In [17]:
k = pd.DataFrame([7,8,9], columns=['zeeshan']) #creating a new dataframe with a column I want to add
df['zeeshan'] = k['zeeshan'] #adding the new column to the existing dataframe

In [18]:
df

         shahbaz  krishna  ibrahim  zeeshan
English        1        2        3      NaN
Maths          4        5        6      NaN
Science        6        7        8      NaN

In [21]:
k = pd.DataFrame([7,8,9], index=['English','Maths','Science'], columns=['zeeshan'])

In [22]:
k

         zeeshan
English        7
Maths          8
Science        9

In [23]:
df['zeeshan'] = k['zeeshan']

In [24]:
df

         shahbaz  krishna  ibrahim  zeeshan
English        1        2        3        7
Maths          4        5        6        8
Science        6        7        8        9

**Thank You**